In [58]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [59]:
df=pd.DataFrame(randn(5,4),index="A B C D E".split(),columns="W X Y Z".split())
df

          W         X         Y         Z
A -0.991904  0.976252  2.275641 -0.694963
B -0.918354  0.950312 -0.045834  1.003063
C -2.790989 -1.826461 -0.269795  0.275947
D  1.509385  1.429003  0.345523  0.700001
E -0.777504 -0.877597  0.044169  0.999291

In [60]:
df["W"]

A   -0.991904
B   -0.918354
C   -2.790989
D    1.509385
E   -0.777504
Name: W, dtype: float64

In [61]:
#pass a list of column names
df[["W","Z"]]

          W         Z
A -0.991904 -0.694963
B -0.918354  1.003063
C -2.790989  0.275947
D  1.509385  0.700001
E -0.777504  0.999291

In [62]:
type(df["W"])

pandas.core.series.Series

In [63]:
#creating new column
df["new"]=df["W"]+df["Y"]
df

          W         X         Y         Z       new
A -0.991904  0.976252  2.275641 -0.694963  1.283737
B -0.918354  0.950312 -0.045834  1.003063 -0.964188
C -2.790989 -1.826461 -0.269795  0.275947 -3.060783
D  1.509385  1.429003  0.345523  0.700001  1.854908
E -0.777504 -0.877597  0.044169  0.999291 -0.733335

In [64]:
#removing columns
df.drop("new",axis=1)

          W         X         Y         Z
A -0.991904  0.976252  2.275641 -0.694963
B -0.918354  0.950312 -0.045834  1.003063
C -2.790989 -1.826461 -0.269795  0.275947
D  1.509385  1.429003  0.345523  0.700001
E -0.777504 -0.877597  0.044169  0.999291

In [65]:
df.drop("E",axis=0)

          W         X         Y         Z       new
A -0.991904  0.976252  2.275641 -0.694963  1.283737
B -0.918354  0.950312 -0.045834  1.003063 -0.964188
C -2.790989 -1.826461 -0.269795  0.275947 -3.060783
D  1.509385  1.429003  0.345523  0.700001  1.854908

In [66]:
#selecting rows
df.loc["A"]

W     -0.991904
X      0.976252
Y      2.275641
Z     -0.694963
new    1.283737
Name: A, dtype: float64

In [67]:
#or select based off of position instead of label
df.iloc[0]

W     -0.991904
X      0.976252
Y      2.275641
Z     -0.694963
new    1.283737
Name: A, dtype: float64

In [68]:
df.iloc[2]

W     -2.790989
X     -1.826461
Y     -0.269795
Z      0.275947
new   -3.060783
Name: C, dtype: float64

In [69]:
#selecting subset of rows and columns
df.loc["B","Y"]

-0.045833964033137956

In [70]:
df.loc[["A","B"],["W","Y"]]

          W         Y
A -0.991904  2.275641
B -0.918354 -0.045834

In [71]:
#conditional selection 
# an importent feature of pandas is conditional selection using bracket notation very similar to numpy
df

          W         X         Y         Z       new
A -0.991904  0.976252  2.275641 -0.694963  1.283737
B -0.918354  0.950312 -0.045834  1.003063 -0.964188
C -2.790989 -1.826461 -0.269795  0.275947 -3.060783
D  1.509385  1.429003  0.345523  0.700001  1.854908
E -0.777504 -0.877597  0.044169  0.999291 -0.733335

In [72]:
df>0

       W      X      Y      Z    new
A  False   True   True  False   True
B  False   True  False   True  False
C  False  False  False   True  False
D   True   True   True   True   True
E  False  False   True   True  False

In [73]:
df[df>0]

          W         X         Y         Z       new
A       NaN  0.976252  2.275641       NaN  1.283737
B       NaN  0.950312       NaN  1.003063       NaN
C       NaN       NaN       NaN  0.275947       NaN
D  1.509385  1.429003  0.345523  0.700001  1.854908
E       NaN       NaN  0.044169  0.999291       NaN

In [74]:
df[df["W"]>2]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [75]:
df[df["W"]>0]["Y"]

D    0.345523
Name: Y, dtype: float64

In [76]:
df[df["W"]>0][["Y","X"]]

          Y         X
D  0.345523  1.429003

In [77]:
#for 2 conditions you can use | and & with parenthesis
df[(df["W"]>0)&(df["Y"]>1)]

Empty DataFrame
Columns: [W, X, Y, Z, new]
Index: []

In [78]:
df

          W         X         Y         Z       new
A -0.991904  0.976252  2.275641 -0.694963  1.283737
B -0.918354  0.950312 -0.045834  1.003063 -0.964188
C -2.790989 -1.826461 -0.269795  0.275947 -3.060783
D  1.509385  1.429003  0.345523  0.700001  1.854908
E -0.777504 -0.877597  0.044169  0.999291 -0.733335

In [79]:
#reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z       new
0     A -0.991904  0.976252  2.275641 -0.694963  1.283737
1     B -0.918354  0.950312 -0.045834  1.003063 -0.964188
2     C -2.790989 -1.826461 -0.269795  0.275947 -3.060783
3     D  1.509385  1.429003  0.345523  0.700001  1.854908
4     E -0.777504 -0.877597  0.044169  0.999291 -0.733335

In [80]:
newind="CA NY WY OR CO".split()
df["states"]=newind
df

          W         X         Y         Z       new states
A -0.991904  0.976252  2.275641 -0.694963  1.283737     CA
B -0.918354  0.950312 -0.045834  1.003063 -0.964188     NY
C -2.790989 -1.826461 -0.269795  0.275947 -3.060783     WY
D  1.509385  1.429003  0.345523  0.700001  1.854908     OR
E -0.777504 -0.877597  0.044169  0.999291 -0.733335     CO

In [81]:
df.set_index("states",inplace=True)
df

               W         X         Y         Z       new
states
CA     -0.991904  0.976252  2.275641 -0.694963  1.283737
NY     -0.918354  0.950312 -0.045834  1.003063 -0.964188
WY     -2.790989 -1.826461 -0.269795  0.275947 -3.060783
OR      1.509385  1.429003  0.345523  0.700001  1.854908
CO     -0.777504 -0.877597  0.044169  0.999291 -0.733335

In [82]:
#multi index and index hierarchy
#index levels
outside=["G1","G1","G1","G2","G2","G2"]
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [83]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["A","B"])
df

             A         B
G1 1  1.823353 -0.837173
   2 -1.116310 -1.883743
   3  1.648292 -0.242912
G2 1  0.173033  0.128794
   2 -2.217254 -1.741774
   3  0.127657  0.504467

In [84]:
df.loc["G1"].loc[1]

A    1.823353
B   -0.837173
Name: 1, dtype: float64

In [85]:
df.index.names

FrozenList([None, None])

In [86]:
df.index.names=["Group","Num"]
df

                  A         B
Group Num
G1    1    1.823353 -0.837173
      2   -1.116310 -1.883743
      3    1.648292 -0.242912
G2    1    0.173033  0.128794
      2   -2.217254 -1.741774
      3    0.127657  0.504467

In [87]:
#xs function return the specified portion fromthe dataframe
#here the function returns the value from the index"G1"
df.xs("G1")

            A         B
Num
1    1.823353 -0.837173
2   -1.116310 -1.883743
3    1.648292 -0.242912

In [88]:
df.xs(["G1",1])

C:\Users\MUJEEB\AppData\Local\Temp\ipykernel_19776\4181962490.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(["G1",1])

A    1.823353
B   -0.837173
Name: (G1, 1), dtype: float64

In [89]:
df.xs(1,level="Num")

              A         B
Group
G1     1.823353 -0.837173
G2     0.173033  0.128794

In [90]:
#series
#creating series 
#we can convert a list,numpy array,or dictionary to a series
labels=["a","b","c"]
my_list=[10,20,30]
arr=np.array([10,20,30])
d={"a":10,"b":20,"c":30}

In [91]:
#using list
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [92]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [93]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [94]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [95]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [96]:
#dictionary
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [97]:
#data in series 
#a pandas series can hold a variety of object types
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [98]:
#using an index
ser1=pd.Series([1,2,3,4],index=["USA","germany","USSR","japan"])
ser1

USA        1
germany    2
USSR       3
japan      4
dtype: int64

In [99]:
ser2=pd.Series([1,2,5,4],index=["USA","germany","italy","japan"])
ser2

USA        1
germany    2
italy      5
japan      4
dtype: int64

In [100]:
ser1["USA"]

1

In [101]:
#operations are then also done based off of index
ser1+ser2

USA        2.0
USSR       NaN
germany    4.0
italy      NaN
japan      8.0
dtype: float64

In [102]:
#missing data
df=pd.DataFrame({"A":[1,2,np.nan],
                "B":[5,np.nan,np.nan],
                "C":[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [103]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [104]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [105]:
#thresh takes integer value which tells minimum amount of na values to drop
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [106]:
df.fillna(value="FULL VALUE")

            A           B  C
0         1.0         5.0  1
1         2.0  FULL VALUE  2
2  FULL VALUE  FULL VALUE  3

In [107]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [108]:
#group by
#create dataframe
data={"company":["GOOG","GOOG","MSFT","MSFT","FB","FB"],
     "person":["sam",'charlie',"amy","vanessa","car1","sarah"],
     "sales":[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  company   person  sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     car1    243
5      FB    sarah    350

In [109]:
df.groupby("company")
by_comp=df.groupby("company")

In [110]:
by_comp.mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [111]:
df.groupby("company").mean()

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [112]:
#more examples of aggregate method
by_comp.std()

              sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [113]:
by_comp.min()

          person  sales
company
FB          car1    243
GOOG     charlie    120
MSFT         amy    124

In [114]:
by_comp.max()

          person  sales
company
FB         sarah    350
GOOG         sam    200
MSFT     vanessa    340

In [115]:
by_comp.count()

         person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [116]:
by_comp.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [117]:
by_comp.describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [118]:
by_comp.describe().transpose()["GOOG"]

sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [119]:
#operations
df=pd.DataFrame({"col1":[1,2,3,4],"col2":[444,555,666,777],"col3":["abc","def","ghi","xyz"]})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [120]:
df["col2"].unique()

array([444, 555, 666, 777], dtype=int64)

In [121]:
df["col2"].nunique()

4

In [122]:
df["col2"].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

In [135]:
#select from dataframe using criteria from multiple column
newdf=df[(df["col1"]>2) & (df["col2"]==444)]
newdf

KeyError: 'col1'

In [124]:
df["col3"].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [125]:
df["col1"].sum()

10

In [126]:
#permanently removing the column
del df["col1"]
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [127]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [128]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [129]:
df.sort_values(by="col2") #inplace =false by default

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [130]:
#find or check the null values 
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [131]:
#drop rows with nan values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [132]:
df=pd.DataFrame({"col1":[1,2,3,np.nan],
                 "col2":[np.nan,555,666,777],
                 "col3":["abc","def","ghi","xyz"]})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  777.0  xyz

In [133]:
df.fillna("FILL")

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  777.0  xyz

In [134]:
data={"A":["foo","foo","foo","bar","bar","bar"],
     "B":["one",'one',"two","two","one","one"],
     "C":["x","y","x","y","x","y"],
     "D":[1,3,2,5,4,1]}
df=pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1